/*Вывести на экран текущую дату в аналогичном виде "21 02 2014".*/


public class Data {
    public static void main(String[] args) {
     //   System.out.print(24 + " "+);
    }
}
